## pandas syntex

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 ={
    "name":['subhash','sunil','surendra','ghansu'],
    "state":['parmanpura','jaipur','jodhpur','bhuvneswar'],
    "Age":[22,23,23,22],
    "height":[6.0,6.1,6.2,6.3],
}

### set a data frame

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

       name       state  Age  height
0   subhash  parmanpura   22     6.0
1     sunil      jaipur   23     6.1
2  surendra     jodhpur   23     6.2
3    ghansu  bhuvneswar   22     6.3

### csv formating to Data Frame(df)

In [5]:
df.to_csv("data1")

In [6]:
df.to_csv("data1",index = False)

showing without index

#### showing DataFrame value head ,tails

In [7]:
df.head(1)

      name       state  Age  height
0  subhash  parmanpura   22     6.0

In [8]:
df.tail(2)

       name       state  Age  height
2  surendra     jodhpur   23     6.2
3    ghansu  bhuvneswar   22     6.3

### static analysis

In [9]:
df.describe()

            Age    height
count   4.00000  4.000000
mean   22.50000  6.150000
std     0.57735  0.129099
min    22.00000  6.000000
25%    22.00000  6.075000
50%    22.50000  6.150000
75%    23.00000  6.225000
max    23.00000  6.300000

### convert  csv file format to DataFrame(df)

In [11]:
subh = pd.read_csv('data1')

In [13]:
subh

       name       state  Age  height
0   subhash  parmanpura   22     6.0
1     sunil      jaipur   23     6.1
2  surendra     jodhpur   23     6.2
3    ghansu  bhuvneswar   22     6.3

### replace the value there alredy exist

In [15]:
subh['Age'][0]=30

C:\Windows\Temp\ipykernel_7088\4100941580.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subh['Age'][0]=30

there is showing error because you can't change the value directly

### there is the another way to change the value

In [18]:
newdf=df.copy()

In [28]:
newdf.loc[0,'Age']=31

In [31]:
newdf.iloc[0,2]=32

In [32]:
newdf

       name       state  Age  height
0   subhash  parmanpura   32     6.0
1     sunil      jaipur   23     6.1
2  surendra     jodhpur   23     6.2
3    ghansu  bhuvneswar   22     6.3

### Drop the column

In [34]:
newdf1 = newdf.drop('name',axis=1)

In [36]:
newdf1

        state  Age  height
0  parmanpura   32     6.0
1      jaipur   23     6.1
2     jodhpur   23     6.2
3  bhuvneswar   22     6.3

In [37]:
newdf

       name       state  Age  height
0   subhash  parmanpura   32     6.0
1     sunil      jaipur   23     6.1
2  surendra     jodhpur   23     6.2
3    ghansu  bhuvneswar   22     6.3